# PointCloudOverrideSettings Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointCloudOverrideSettings Constructor
PointCloudOverrideSettings Class See Also
---
Constructs a settings object with default values.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public PointCloudOverrideSettings()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
PointCloudOverrideSettings()
```

# See Also
PointCloudOverrideSettings Class
PointCloudOverrideSettings Overload
Autodesk.Revit.DB.PointClouds Namespace